import 'package:flutter/material.dart';
import 'package:aaabbb/Homepage';
import 'main.dart';

class Info {
  static List<String> name = [
    "корова",
    "собака",
    "кошка",
    "лев",
    "тигр",
    "кит",
    "овца",
    "козёл",
    "леопард",
    "бык",
  ];
  static List<String> club = [
    "103",
    "374",
    "326",
    "390",
    "12",
    "905",
    "409",
    "48",
    "30",
    "102",
    "205",
  ];
  static List<String> information = [
    "Коро́ва — отелившаяся самка крупного рогатого скота, то есть домашнего быка. Прежде чем стать коровой, самка быка является тёлкой, после оплодотворения до первых родов она называется нетелью. Коровы используются для получения потомства, а также молочной и мясной продукции.",
    "Соба́ка — домашнее животное, одно из наиболее популярных животных-компаньонов. Домашняя собака была описана как самостоятельный биологический вид Canis familiaris Линнеем в 1758 году; в настоящее время данное научное название признаётся многими авторитетными организациями, такими как Американское общество маммалогов.",
    "Ко́шка — домашнее животное, одно из наиболее популярных «животных-компаньонов». С точки зрения научной систематики, домашняя кошка — млекопитающее семейства кошачьих отряда хищных",
    "Лев — вид хищных млекопитающих, один из пяти представителей рода пантер, относящегося к подсемейству больших кошек в составе семейства кошачьих. Наряду с тигром — самая крупная из ныне живущих кошек, масса некоторых самцов может достигать 250 кг.",
    "Тигр — вид хищных млекопитающих семейства кошачьих, один из пяти представителей рода пантера, который относится к подсемейству больших кошек. Слово «тигр» происходит от др.-греч. τίγρις, которое в свою очередь восходит к др.-перс. *tigri от корня «*taig» со значением «острый; быстрый»",
    "Длина тела взрослого кита этого вида может достигать 33 метров, а масса – превышать 150 тонн. Киты произошли от сухопутных парнокопытных млекопитающих, и случился этот эволюционный скачок около 54 млн лет назад. На их огромных телах до сих пор есть шерсть, они теплокровны и выкармливают свое потомство молоком.",
    "Домашняя овца — парнокопытное млекопитающее из рода баранов, семейства полорогих. Это животное уже в глубокой древности было одомашнено человеком, восновном из-за густой шерсти и съедобного мяса. В настоящее время стриженая овечья шерсть, или руно, используется человеком чаще, чем шерсть любого другого животного.",
    "Домашняя коза — домашнее животное, вид парнокопытных из рода горные козлы семейства полорогих. Коза — одно из первых прирученных животных. Одомашнена на Ближнем Востоке, приблизительно 9 тыс. лет назад",
    "Длина тела 126—183 см, длина хвоста 94—116 см. Наибольшая длина черепа самцов 20—25 см, самок 20—21,8 см. Длина верхнего ряда зубов самцов 68—75 мм, самок 64—67 мм. Высота в холке может достигать 76 см, а масса — 70 кг.",
    "Быки́ (лат. Bovini) — систематическая группа полорогих парнокопытных млекопитающих, в настоящее время имеющая таксономический ранг трибы в подсемействе Bovinae. Раньше быки были единственными представителями подсемейства Bovinae, но после новых генетических исследований в него зачислили также и винторогих антилоп.",];
  static List<Color> color =[
    Colors.brown,
    Colors.orange,
    Colors.lime,
    Colors.purple,
    Colors.amber,
    Colors.red,
    Colors.blue,
    Colors.green,
    Color.fromARGB(255, 114, 113, 103),
    Color.fromARGB(255, 158, 88, 88),
  ];
  static List<double> size =[
    20,
    20,
    20,
    20,
    20,
    20,
    20,
    20,
    20,
    20,
    20,
  ];
}